Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཕྱག་དང་ཞབས་དྲ་བ་ཅན་སྤ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the beauty of the webbed hands and feet.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ཕྱག་དང་ཞབས་དྲ་བ་ཅན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the hands and feet being webbed.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་བྱིན་པ་རི་དགས་ཨེ་ནེ་ཡའི་ལྟ་བུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as antelope-like thighs?

source: ལེགས་པར་སྐྱེས་པ་ཡོངས་སུ་རྫོགས་ཤིང་རིམ་གྱིས་གཞོལ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as being perfectly developed and tapering.

source: འཇམ་ཞིང་མི་མངོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as being smooth and inconspicuous.

source: ཤིན་ཏུ་སྦྱངས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as being perfectly pliable.

source: གཤེགས་པར་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the stride.

source: ཀུན་ནས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as being perfectly well distinguished.

source: ཁ་དོག་སྣང་བ་མཐོང་ན་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as a radiant and delightful hue.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་བྱིན་པ་རི་དགས་ཨེ་ནེ་ཡའི་ལྟ་བུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as antelope-like thighs.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་གསང་བའི་སྦུབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the concealing sheath?

source: གསང་བའི་སྦུབས་ཁ་དོག་མཛེས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as a sheath of beautiful color.

source: ཤིན་ཏུ་སྦས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as being hidden.

source: ཚེམས་ཚང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the completeness of the teeth.

source: ཕྱག་གི་རི་མོ་སྙོམས་ཤིང་ཤིན་ཏུ་ལེགས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the even and perfectly well-formed lines of the hands.

source: མི་འཇིགས་པ་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the bestowing of fearlessness.

source: གཞན་བལྟ་བའི་ཕྱིར་སྤྲུལ་པ་ཉེ་བར་བསྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the accomplishment of emanations in order to be seen by others.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་གསང་བའི་སྦུབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the concealing sheath.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་ལྟེ་བ་ཟབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the deep navel?

source: ཟབ་ཅིང་རིམ་པར་འཚམ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as depth and excellent proportions.

source: ལྟེ་བ་གཟི་བྱིན་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as a navel of splendor.

source: ཟབ་ཅིང་མདངས་ཡོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as depth and brightness.

source: ལྟེ་བ་ཡངས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the wideness of the navel.

source: ལྟེ་བ་རྒྱས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the full development of the navel.

source: ལྟེ་བ་མ་ཞུམ་ཞིང་སྤ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the navel being firm and protected.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ལྟེ་བ་ཟབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ།། །།
en: Such are the six perfections that ripen as the deep navel.

source: འཕགས་པ་བསྐལ་པ་བཟང་པོ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། བམ་པོ་དྲུག་པ། དེ་ལ་རྣམ་པར་སྨིན་པ་སྤུ་རེ་རེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as hair in each bodily pore?

source: སྐུའི་སྤུ་གྱེན་དུ་ཕྱོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the hairs turning upward.

source: མདོག་མཐོན་ཏིང་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as their bluish black color.

source: སྣུམ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as their luster.

source: ཁ་དོག་མཛེས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as their beautiful color.

source: གཡས་སུ་འཁྱིལ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as their curling to the left.

source: ཕན་ཚུན་མ་འཛིངས་ཤིང་མི་འགྲེང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the hair never being ruffled or bristly.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་སྤུ་རེ་རེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen hair in each bodily pore.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་གསེར་གྱི་མདོག་ཅན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the golden complexion?

source: གསེར་མདོག་གསེར་གྱི་ཁ་དོག་ཅན་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the color’s golden luster.

source: གསེར་གྱི་མདོག་ཅན་མདངས་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the brightness of the golden hue.

source: གསེར་གྱི་མདོག་ཅན་སྐྱོན་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the flawlessness of the golden hue.

source: གསེར་གྱི་མདོག་ཅན་བལྟར་རུང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the attractiveness of the golden hue.

source: གསེར་གྱི་མདོག་ཅན་དྲི་མ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the stainlessness of the golden hue.

source: གསེར་གྱི་མདོག་ཅན་འོད་རྒྱ་ཆེ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the vast radiance of the golden hue.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་གསེར་གྱི་མདོག་ཅན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the golden complexion.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་སྐུ་རོ་སྟོད་སེང་གེ་འདྲ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the lion-like upper body?

source: སྐུ་རིམ་པར་འཚམ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the body being well proportioned.

source: སྐུ་རོ་སྟོད་ལེགས་པར་འབྲེལ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the upper body being well formed.

source: སྐུ་རོ་སྟོད་མཁྲེགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the upper body’s firmness.

source: སྐུ་རོ་སྟོད་བལྟ་ན་བཟང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the upper body being beautiful to behold.

source: སྐུ་རོ་སྟོད་ཤིན་ཏུ་ཡངས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the upper body being very broad.

source: སྐུ་རོ་སྟོད་སེང་གེའི་ལྟ་བུ་མི་ཤིགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the indestructibility of the lion-like upper body.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་སྐུ་རོ་སྟོད་སེང་གེ་འདྲ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the lion-like upper body.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་བདུན་མཐོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the seven well-proportioned body parts?

source: བདུན་མཐོ་བ་ཡོངས་སུ་རྫོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the completeness of the seven well-proportioned body parts.

source: མཐོ་བ་བཀྲ་ཤིས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the auspicious elevation of the seven well-proportioned body parts.

source: མཐོང་ན་ཡིད་དགའ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the seven well-proportioned body parts being delightful to see.

source: མཐོ་བ་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the seven well-proportioned body parts being evenly formed.

source: མཐོ་ཞིང་མ་ཞུམ་ལ་མཛེས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the loftiness, firmness, and beauty of the seven well-proportioned body parts.

source: འཇམ་ཞིང་སྣུམ་ལ་དང་ཞིང་གསལ་ལ་མཐོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the smoothness, luster, clarity, and loftiness of the seven well-proportioned body parts.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་བདུན་མཐོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the seven well-proportioned body parts.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་ཕྱག་རིང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the long hands?

source: བདུག་སྤོས་ཀྱི་སྦྱིན་པ་དང་གཏོང་བའི་སྦྱིན་པས་ཕྱག་རིང་བ་མ་བཅད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Offering incense and giving through relinquishment lend the hands their uninterrupted length. Such is the ripening of the perfection of generosity.

source: མི་མཐོ་ཞིང་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as not being raised but stationary.

source: ཚིགས་སྲ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the firmness of the joints.

source: རིམ་གྱིས་གཞོལ་ཞིང་རིང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as their length and tapering design.

source: ཕྱག་སྟོབས་ལ་ཕ་རོལ་གནོན་པས་བསྐྱད་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as powerful hands that cannot be moved by force.

source: མཐོང་ན་མདངས་དང་ལྡན་ཞིང་འདོད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the hands being radiant and attractive to behold.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ཕྱག་རིང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the long hands.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་སྐུ་ཁྲིལ་བག་ཆགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the perfectly proportionate body?

source: ཤིན་ཏུ་ཁྲིལ་བག་ཆགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the tremendous perfectly proportionate body.

source: གཡོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as imperturbability.

source: ཕྱོགས་ཤིན་ཏུ་རྣམ་པར་འབྱེས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as its tremendous beauty.

source: སྐུ་རིམ་པར་འཚམ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the body being perfectly proportionate.

source: ཚིགས་མི་མངོན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the joints not being visible.

source: བལྟ་ན་སྡུག་ཅིང་སེམས་ཅན་ཐམས་ཅད་དགའ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the body being delightful and gratifying to see for all beings.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་སྐུ་ཁྲིལ་བག་ཆགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the perfectly proportionate body.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་མགུར་དུང་ལྟ་བུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the conch-like throat?

source: དུང་ལྟར་བྱིན་གྱིས་ཟླུམ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as being well-proportioned like a conch.

source: ཤིན་ཏུ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as perfect stability.

source: རྩེའུ་ཆུང་མི་མངོན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the veins not being visible.

source: ལེགས་པར་གྲུབ་ཅིང་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as being well shaped and even.

source: ཤིན་ཏུ་གཞོན་ཤ་ཆགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as tremendous youthfulness.

source: གཅད་དུ་མེད་ཅིང་དབྱེར་མེད་ལ་མི་མཐོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as being impossible to cut, seamless, and not protruding.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་མགུར་དུང་ལྟ་བུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the conch-like throat.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་སྒྲོས་བིམ་པ་ལྟར་དམར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as lips that are red like a bimba fruit?

source: སྒྲོས་བིམ་པ་ལྟར་དམར་ཞིང་འཛུམ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as smiling lips that are red like a bimba.

source: སྒྲོས་བིམ་པ་ལྟར་དམར་ཞིང་ལེགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as lips that are red and full.

source: ལྟག་འོག་ལེགས་པར་འབྱོར་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as upper and lower lips that join nicely.

source: གསུང་བ་དང་མི་གསུང་བར་གྱུར་པ་ན་རྟག་ཏུ་བལྟ་ན་ཡིད་དུ་འོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as lips that are always beautiful to behold, whether speaking or silent.

source: བྱི་རུ་ལྟར་སྣང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as a coral-like radiance.

source: བལྟ་ན་བརྟག་ཏུ་རུང་ཞིང་བལྟ་བས་མི་ངོམས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as always being attractive to look at, such that people never tire of gazing at them.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་སྒྲོས་བིམ་པ་ལྟར་དམར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections that ripen as lips that are red like bimba fruit.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་ཚེམས་མཆེ་བ་དཀར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as white canine teeth?

source: ཤིན་ཏུ་དཀར་བ་གང་ཡིན་པ་དེ་ནི་གོས་དཀར་པོ་བྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Giving white clothes ripens as bright white canine teeth.

source: ཚེམས་དཀར་ཞིང་མདངས་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as white and radiant canine teeth.

source: བར་གྱི་དྲི་མ་བསལ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the spaces between the teeth being free from impurities.

source: ཚེམས་དཀར་ཞིང་མཁྲེགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as white and hard canine teeth.

source: དྲི་ཞིམ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as a delightful fragrance.

source: ཡིད་དུ་འོང་ཞིང་མདངས་དང་ལྡན་ལ་འོད་གསལ་བ་བལྟ་བས་མི་ངོམས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as beauty, radiance, luminosity, and being captivating to behold.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ཚེམས་མཆེ་བ་དཀར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as white canine teeth.

source: དེ་ལ་ཚེམས་མཉམ་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as evenly spaced teeth?

source: ཚེམས་ལྟག་འོག་མཉམ་པ་གང་ཡིན་པ་དེ་ནི་ཚེམས་མཉམ་པས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the upper and lower teeth being aligned.

source: ཚེམས་ལྟག་འོག་ཕྱིར་མ་གྱེད་ཅིང་ལེགས་པར་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the upper and lower teeth being aligned and well formed.

source: ཀུན་ནས་ཐགས་བཟང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the teeth being very closely spaced.

source: ཚེམས་ཟླུམ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the teeth being well proportioned.

source: མ་གྲུགས་ཤིང་ཆུ་སྒོ་མ་དོད་ལ་སྲ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as teeth that do not fracture, do not have excessive saliva, and are hard.

source: འོག་མ་ཡང་ལྟག་མ་དང་འཚམ་ལ་ལྟག་མ་ཡང་འོག་མ་དང་འཚམ་པ་མཚམས་ཐད་ཀར་འབྱོར་པ་བལྟ་ན་སྡུག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the upper and lower teeth fitting perfectly to one another, connecting directly, and being gorgeous to behold.

source: འདི་དག་ནི་ཚེམས་མཉམ་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as evenly spaced teeth.

source: དེ་ལ་ཚེམས་བཞི་བཅུ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the set of forty teeth?

source: ཚེམས་བཞི་བཅུ་ཚང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens the completeness of the set of forty teeth.

source: ཚེམས་ཐགས་བཟང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the forty teeth being set very closely.

source: ཚེམས་མ་གཙིགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the teeth being unobtrusive.

source: ཚེམས་རྣོ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the sharpness of the teeth.

source: ཚེམས་ལེགས་པར་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the teeth being well formed.

source: ཚེམས་ཤིན་ཏུ་བརྟན་ཞིང་ཡིད་དུ་འོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the teeth being durable and attractive.

source: འདི་དག་ནི་ཚེམས་བཞི་བཅུ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the set of forty teeth.

source: དེ་ལ་ལྗགས་རིང་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the long tongue?

source: སྙན་གྱི་བུ་ག་རྒྱ་ཆེར་འགེབས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the tongue being long enough to cover the ear openings.

source: ལྗགས་དྲི་མས་མ་སྦགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the tongue being free from impurities.

source: ལྗགས་རྐན་ལ་འབྱར་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the tongue being joined to the palate.

source: ལྗགས་ཤིན་ཏུ་རྒྱ་ཆེ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the tongue being exceptionally large.

source: མཚན་དང་ལྡན་པར་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the tongue bearing perfect marks.

source: དེ་པད་མ་འདབ་མ་བརྒྱ་པའི་ཁ་དོག་ཏུ་ལེགས་པར་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the tongue having the colors of a hundred-petaled lotus.

source: འདི་དག་ནི་ལྗགས་རིང་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the long tongue.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཚངས་པའི་དབྱངས་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that engender the voice of Brahmā?

source: དབྱངས་གསང་མཐོ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the prominence of the voice.

source: དགའ་བར་འགྱུར་བའི་དབྱངས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the attractiveness of the voice.

source: དབྱངས་སྣ་ཚོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the richness of the voice.

source: དབྱངས་ཟིལ་གྱིས་མི་ནོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the voice’s overpowering quality.

source: དབྱངས་རྒྱུན་ཆད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the continuity of the voice.

source: སྒྲ་དང་བརྡ་ཐམས་ཅད་ལ་དབྱངས་སྙན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as a beautiful voice pronouncing all words and expressions.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚངས་པའི་དབྱངས་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that engender the bodhisattva’s voice of Brahmā.

source: གཞན་ཡང་ལུས་དང་སེམས་བདེ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: “Moreover, generosity ripens as the factor that engenders well-being in body and mind.

source: རྣར་སྙན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: The ripening of discipline makes the voice delightful to hear.

source: སྙིང་སིམ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience satisfies the heart.

source: འཁོར་ཐམས་ཅད་མི་འདོར་བར་གོ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence keeps the audience intact and instills understanding.

source: བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་ལྟ་བུའི་དབྱངས་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes the voice similar to that of the kalaviṅka.

source: ཐེ་ཚོམ་གཅོད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the factor that cuts through doubts.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ཚངས་པའི་དབྱངས་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen to accomplish the voice of Brahmā.

source: དེ་ལ་མཚན་རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པར་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that engender the mark of an excellent sense of taste?

source: ཞལ་ཟས་ཐམས་ཅད་ཐུགས་སུ་བྱོན་ཅིང་རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The ripening of generosity makes it possible to appreciate and savor all kinds of food.

source: ཞལ་ཟས་གསོལ་ནས་བདེ་བར་འཇུ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ensures that the food that is offered is digested well.

source: ཞལ་ཟས་མཛེས་པར་གསོལ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ensures that the food is offered beautifully.

source: ཞལ་ཟས་མང་ཉུང་འདྲ་བར་འཇུ་ཞིང་ཁམས་འཁྲུག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ensures comfortable digestion of the right amount of food.

source: གཟི་བྱིན་དང་ལྡན་པ་གང་ཡིན་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ensures the beauty of the food.

source: མྱུར་དུ་སྤང་བར་རུང་ལ་ཧ་ཅང་ཡང་མི་གྲང་ཧ་ཅང་ཡང་མི་ཚ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ensures that the food can be taken quickly and that it is neither too hot nor too cold.

source: འདི་དག་ནི་རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen to engender the mark of an excellent sense of taste.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་འགྲམ་པ་སེང་གེའི་ལྟ་བུ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections whereby the bodhisattvas accomplish the lion-like jaw?

source: འགྲམ་པ་སེང་གེའི་ལྟ་བུ་རྒྱས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the fullness of the lion-like jaw.

source: འགྲམ་པ་སེང་གེའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the jaw’s semblance to that of a lion.

source: འགྲམ་པ་སེང་གེའི་ལྟ་བུ་ལེགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as the well-formed character of the lion-like jaw.

source: མཐོང་ན་དབང་ཆེ་བར་གྲགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as its appearance of being highly eminent.

source: ཐམས་ཅད་དུ་མ་ཉམས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as being well beyond deterioration.

source: མདོག་འཇམ་ཞིང་བལྟ་ན་སྡུག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as a refined hue and beauty.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་འགྲམ་པ་སེང་གེའི་ལྟ་བུ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that engender the lion-like jaw.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཞལ་སྲོག་ཆགས་གོ་བའི་མདོག་ལྟ་བུ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections whereby the face becomes colored like the gopa animal?

source: ཞལ་སྲོག་ཆགས་གོ་བའི་མདོག་འདྲ་ཞིང་མཁྲེགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the face being colored like a gopa and being hard.
